[
  {
    "source": "lecture1.pdf",
    "chunk_index": 0,
    "char_count": 800,
    "text": "CS 611: Theory of Computation Hongmin Li California State University, East Bay Hongmin Li CS611 Overview Skills Part I Syllabus Hongmin Li CS611 Overview Skills Course Overview The three main computational models/problem classes in the course Computational Model Applications Finite State Machines/ Regular Expressionstext processing, lexical analysis, protocol veriﬁcation Pushdown Automata/ Context-free Grammarscompiler parsing, software modeling, natural language processing Turing machines undecidability, computational complexity, cryptography Hongmin Li CS611 Overview Skills SkillsComprehend mathematical deﬁnitionsWrite mathematical deﬁnitionsComprehend mathematical proofsWrite mathematical proofs Hongmin Li CS611 Math Preliminaries Part II Math Preliminaries Hongmin Li CS611 Math Prelimi"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 1,
    "char_count": 800,
    "text": "mathematical deﬁnitionsWrite mathematical deﬁnitionsComprehend mathematical proofsWrite mathematical proofs Hongmin Li CS611 Math Preliminaries Part II Math Preliminaries Hongmin Li CS611 Math Preliminaries Sets, functions, relations and sequencesA set is a collection of items. We use 2to denote the belongs to relation, that is, a2A, denotes that a is an element of A. A={1,2,3}is a set whose elements are 1, 2 and 3. N={1,2,3,. . .}is the set of natural numbers. It is an inﬁnite set.B={1,2,3,2}is NOT a set, it is a multiset, where duplicate matters. C = {n|ni sa ne v e nn u m b e r }A subset of a set is a set containing zero or more elements of the set. A is a subset of N. Some subsets of A = {1, 2, 3 }are {2, 3},{},{1},{1, 2, 3 }.H e r e1 2A,4/2A. Hongmin Li CS611 Math Preliminaries Questi"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 2,
    "char_count": 800,
    "text": " a set is a set containing zero or more elements of the set. A is a subset of N. Some subsets of A = {1, 2, 3 }are {2, 3},{},{1},{1, 2, 3 }.H e r e1 2A,4/2A. Hongmin Li CS611 Math Preliminaries QuestionsHow many subsets there exists for a set A that has n elements? Hongmin Li CS611 Math Preliminaries Special SetsThe empty set {}: denote, ;,as e tt h a th a sn oe l e m e n t sUniversal set U:e i t h e re s p e c i a l l ys t a t e do ri m p l i c i t ,e x a m p l e s : natural numbers N=0,1,2,3,. . ., integers N={...,\u00002,\u00001,0,1,2,. . .} Hongmin Li CS611 Math Preliminaries Operations on SetsCartesian Product of Sets: Given two sets A and B, the Cartesian product A⇥Bis the set consisting of all elements of the form (x, y) where x is an element of A and y is an element of B. A⇥B={(x,y)|x2A,y2B}"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 3,
    "char_count": 800,
    "text": "sian Product of Sets: Given two sets A and B, the Cartesian product A⇥Bis the set consisting of all elements of the form (x, y) where x is an element of A and y is an element of B. A⇥B={(x,y)|x2A,y2B}If A = {1, 2},B= {a, b, c },w h a ti s A⇥B? A⇥B={(1,a),(2,a),(1,b),(2,b),(1,c),(2,c)}Power Set: Given a set A, a power set of A, is a SET which A consists of all the subsets of A. It is denoted as Pow(A)o r2A .I fA={1,2},2A={{},{1},{2},{1,2}}.Union A[B={x|x2Aorx2B}Intersection A\\B={x|x2Aandx2B}Complement with respect to a Universe U, A={x|x2U,x/2A}. Hongmin Li CS611 Math Preliminaries SequenceA sequence is a list of objects in order. Repetition and order both matter in a sequence. (1 ,2,3)6=( 1 ,1,2,3)6=( 2 ,1,3) Hongmin Li CS611 Sets, functions, relations and sequences RelationsAk-ary relatio"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 4,
    "char_count": 800,
    "text": "quence is a list of objects in order. Repetition and order both matter in a sequence. (1 ,2,3)6=( 1 ,1,2,3)6=( 2 ,1,3) Hongmin Li CS611 Sets, functions, relations and sequences RelationsAk-ary relation is a subset of A1⇥A2⇥···⇥Ak.ForA={1,2},B={a,b,c},R={(1,a),(1,b),(2,b)}is a relation.A binary relation R✓A⇥Ais aequivalence relation if it satisﬁes:Reﬂexivity: for every a2A,(a,a)2RSymmetricity: for every a,b2A,i f( a,b)2R,t h e n( b,a)2RTransitivity: for every a,b,c2A,i f( a,b)2Rand ( b,c)2R, then ( a,c)2R. Prabhakar CIS770 Sets, functions, relations and sequences Functions and RelationsAfunction Ffrom AtoB, denoted F:A!B,i sam a p p i n g where for every a2A,t h e r ei sau n i q u ee l e m e n t b2Bthat it is mapped to. We call Athe domain and Bthe range of F.F:A!Bis aone-one function, if f"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 5,
    "char_count": 800,
    "text": "n Ffrom AtoB, denoted F:A!B,i sam a p p i n g where for every a2A,t h e r ei sau n i q u ee l e m e n t b2Bthat it is mapped to. We call Athe domain and Bthe range of F.F:A!Bis aone-one function, if for every a,a02A,i f a6=a0,t h e n F(a)6=F(a0).F:A!Bis aonto function, if for every b2B,t h e r ei sa n a such that F(a)=b.A function is bijective if it is both one-one and onto. Prabhakar CIS770 Sets, functions, relations and sequences Propositional LogicPropositions are facts that are true or false.Operations on propositions: negation ¬, conjunction ^, disjunction _,i m p l i e s !,i↵$ The truth tables are as follows:P¬P TF FT PQP^QP_QP!QP$Q TT T T T T TF F T F F FT F T T F FF F F T T Prabhakar CIS770 Proofs We discussed the following:Deﬁnition capture objects, notions, conceptsMathematical s"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 6,
    "char_count": 800,
    "text": "tables are as follows:P¬P TF FT PQP^QP_QP!QP$Q TT T T T T TF F T F F FT F T T F FF F F T T Prabhakar CIS770 Proofs We discussed the following:Deﬁnition capture objects, notions, conceptsMathematical statementProof - logical argument to establish the correctness of a mathematical statementTheorem - a mathematical statement which has been proved correct Prabhakar CIS770 ExampleDeﬁnition ODD: A integer nis odd if n=2k+ 1 for some integer k, otherwise, it is even, that is, n=2kfor some integer k.Mathematical statement: If nis odd, then n2is odd.Proof: If nis odd, then n=2k+ 1 for some integer k.T h e n n2=( 2k+ 1)2=4k2+4k+ 1 = 2(2 k2+2k) + 1. Since, k0=2k2+2kis an integer and n2=2k0+ 1, n2is odd from the deﬁnition ODD. Prabhakar CIS770 ProofsFor any two sets AandB,¯A[B=¯A\\¯B.An element xis in "
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 7,
    "char_count": 800,
    "text": "h e n n2=( 2k+ 1)2=4k2+4k+ 1 = 2(2 k2+2k) + 1. Since, k0=2k2+2kis an integer and n2=2k0+ 1, n2is odd from the deﬁnition ODD. Prabhakar CIS770 ProofsFor any two sets AandB,¯A[B=¯A\\¯B.An element xis in ¯A[Bi↵it is not in A[B(from the deﬁnition of complement) i ↵xis neither in Anor in B(from the deﬁnition of union) i ↵xis in ¯Aandxis in ¯B(from the deﬁnition of complement) i ↵xis in their intersection ¯A\\¯B (from the deﬁnition of intersection). Prabhakar CIS770 ProofsIfnis an integer and 3 n+2i so d d ,t h e n nis odd.(Contrapositive) If nis not odd (even), then 3 n+ 2 is not odd (even).The truth of a statement is equivalent to its contrapositive. So, we can prove a statement, by proving its contrapositive.Suppose nis even, then n=2k,3n+2=6 k+ 2 = 2(3 k+ 1) is even. Prabhakar CIS770 Proof by "
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 8,
    "char_count": 800,
    "text": " of a statement is equivalent to its contrapositive. So, we can prove a statement, by proving its contrapositive.Suppose nis even, then n=2k,3n+2=6 k+ 2 = 2(3 k+ 1) is even. Prabhakar CIS770 Proof by inductionShow that 1 + 2 + ···+n=n(n+ 1)/2.LetP(n) denote 1 + 2 + ···+n=n(n+ 1)/2. We need to show that P(1),P(2),P(3),··· are all true.We cannot show each of them individually. Prabhakar CIS770 Proof by inductionInduction is a proof technique that allows us to prove a certain factP(n) holds for all n, by showing the following two facts:P(1) is true.For every k,i fP(k)i st r u e ,t h e n P(k+ 1) is true.The ﬁrst statement is called the base case. The second statement is proved for any generic k. We need to argue that P(k+ 1) is true using the fact that P(k)i st r u e .H e r e P(k)i s called th"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 9,
    "char_count": 800,
    "text": "s true.The ﬁrst statement is called the base case. The second statement is proved for any generic k. We need to argue that P(k+ 1) is true using the fact that P(k)i st r u e .H e r e P(k)i s called the induction hypothesis. “For every k,i fP(k)i st r u e , then P(k+ 1) is true.” is the induction step.Note that if we prove the base case and the induction step, then we have shown that P(n)i st r u ef o ra l l n.P(1) is true because of base case, P(2) is true by instantiating k= 1, P(3) is true by taking k= 2 and so on. Prabhakar CIS770 Proof by induction templateShow that 1 + 2 + ···+n=n(n+ 1)/2.Step 0: First, write the statement in the form of: Show that P(n)i st r u ef o ra l l n.LetP(n) denote 1 + 2 + ···+n=n(n+ 1)/2. We need to show that P(n)i st r u ef o ra l l n.Step 1: Prove the base "
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 10,
    "char_count": 800,
    "text": ".Step 0: First, write the statement in the form of: Show that P(n)i st r u ef o ra l l n.LetP(n) denote 1 + 2 + ···+n=n(n+ 1)/2. We need to show that P(n)i st r u ef o ra l l n.Step 1: Prove the base case, that is, P(1) is true.Base case: Show that P(1) is true. To show P(1) is true, we need to show that 1 = 1(1 + 1) /2. Since, both L.H.S and R.H.S are equivalent, we have proved the statement.Step 2: Write down the induction hypothesis. P(k):1+2+ ···+k=k(k+ 1)/2. This will be assumed to be true.Step 3: Prove the induction step. That is, assuming P(k)i s true, prove that P(k+ 1) is true. Prabhakar CIS770 Proof by induction templateShow that 1 + 2 + ···+n=n(n+ 1)/2.Step 3: Prove the induction step. That is, assuming P(k)i s true, prove that P(k+ 1) is true.Need to show that 1 + 2 + ···+k+1= "
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 11,
    "char_count": 800,
    "text": "kar CIS770 Proof by induction templateShow that 1 + 2 + ···+n=n(n+ 1)/2.Step 3: Prove the induction step. That is, assuming P(k)i s true, prove that P(k+ 1) is true.Need to show that 1 + 2 + ···+k+1= k(k+ 1)/2. Think how you can use the P(k) here. Alternative, how can you reduce the statement involving k+ 1 to one involving k.For instance, the L.H.S of P(k+ 1) can be written (1 + 2 + 3 + ···+k)+k+1w h e r et h eﬁ r s tp a r tm a t c h e s with the L.H.S of P(k). Hence, you can replace (1 + 2 + 3 + ···+k)w i t h k(k+ 1)/2. Now, L.H.S of P(k+ 1), namely, (1 + 2 + 3 + ···+k)+k+1i se q u a lt o k(k+ 1)/2+k+1=( k+ 1)( k/2 + 1) = ( k+ 1)( k+ 2)/2, which is the required R.H.S for P(k+ 1). Prabhakar CIS770 Proof by induction templateShow that the number of elements in the power set of Ais 2n, wher"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 12,
    "char_count": 800,
    "text": "k+ 1)/2+k+1=( k+ 1)( k/2 + 1) = ( k+ 1)( k+ 2)/2, which is the required R.H.S for P(k+ 1). Prabhakar CIS770 Proof by induction templateShow that the number of elements in the power set of Ais 2n, where nis the number of elements in A.Step 0: First, write the statement in the form of: Show that P(n)i st r u ef o ra l l n.LetP(n) denote if a set has size n, then the number of elements in its power set is 2n.Step 1: Prove the base case, that is, P(1) is true.Base case: Show that P(1) is true. To show P(1) is true, we need to show that if a set has size 1, then its power set has size 21= 2. Consider a set of size 1. It is of the form A={a}.I t sp o w e rs e ti s {{},{a}}, it has size 2.Step 2: Write down the induction hypothesis. P(k): If a set has size k,t h e ni t sp o w e rs e th a ss i z e"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 13,
    "char_count": 800,
    "text": "er a set of size 1. It is of the form A={a}.I t sp o w e rs e ti s {{},{a}}, it has size 2.Step 2: Write down the induction hypothesis. P(k): If a set has size k,t h e ni t sp o w e rs e th a ss i z e2k.Step 3: Prove the induction step. That is, assuming P(k)i s true, prove that P(k+ 1) is true. Prabhakar CIS770 Proof by induction templateShow that the number of elements in the power set of Ais 2n, where nis the number of elements in A.Step 3: Prove the induction step. That is, assuming P(k)i s true, prove that P(k+ 1) is true.Need to show that the power set of any set with k+1 elements has size 2k+1. Think how you can use the P(k) here. Alternative, how can you reduce the statement involving k+ 1 to one involving k.How is a set of size k+ 1 related to a set of size k?L e t Abe a set of si"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 14,
    "char_count": 800,
    "text": "ze 2k+1. Think how you can use the P(k) here. Alternative, how can you reduce the statement involving k+ 1 to one involving k.How is a set of size k+ 1 related to a set of size k?L e t Abe a set of size k+ 1. Then A=B[{a},w h e r e ais not an element of B,a n d Bis of size k.Consider power set of A, it contains subsets of A.The subsets of Acan be divided into two groups, Xbe the set of all subset of A, which do not contain a,a n d Ybe the set of all subsets of Awhich contain a. Prabhakar CIS770 Proof by induction templateHow many elements are in X? Every element of Xdoes not contain a, hence, it is a subset of B. And all subsets of Bdo not contain a, therefore they are elements of X.T h e r e f o r e , X is exactly the power set of B, and contains 2kelements.How many elements are in Y? Not"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 15,
    "char_count": 800,
    "text": "it is a subset of B. And all subsets of Bdo not contain a, therefore they are elements of X.T h e r e f o r e , X is exactly the power set of B, and contains 2kelements.How many elements are in Y? Note that every element of Y contains a. That is, an element of Yis of the form S[{a}, where Sis a subset of Aand does not contain a,t h a ti s , Sis a subset of B.I nf a c t ,as e t Sbelongs to the power set of B exactly when S[{a}belongs to Y. Therefore the elements of Yare obtained by adding ato every element of the power set ofB. Hence, the number of elements of Yand that of power set of Bare the same, and Yhas 2kelements. The total number of elements in power set of Ais 2k+2k=2k+1. Prabhakar CIS770 Proof by induction templateAs a concrete example for the statements in the above proof, try th"
  },
  {
    "source": "lecture1.pdf",
    "chunk_index": 16,
    "char_count": 464,
    "text": " same, and Yhas 2kelements. The total number of elements in power set of Ais 2k+2k=2k+1. Prabhakar CIS770 Proof by induction templateAs a concrete example for the statements in the above proof, try the following.Take A={1,2,3}. Write the subsets of Awhich do not contain 3, called X, and the elements in the power set of A which contain 3, called Y. You will notice that Xis the power set of B={1,2}and the number of elements in XandYare the same. Prabhakar CIS770"
  }
]